//=============================================================================
//
// 判定可視化用ガイド処理 [guide.h]
// Author : GP11A 15 高橋ほの香
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_GUIDE			(GUIDE_LIST_ALL)
// #define	BC_DIAMETER2		(22.0f)						// ボスの当たり判定に使う直径

enum GUIDE_LIST
{
	GUIDE_SWORD = 0,
	GUIDE_PLAYER,
	GUIDE_BOSSHEAD,
	GUIDE_BOSSTAIL,

	GUIDE_LIST_ALL,
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct GUIDE
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	float				size;				// 当たり判定としての大きさ
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGuide(void);
void UninitGuide(void);
void UpdateGuide(void);
void DrawGuide(void);
GUIDE* GetGuide(void);