//=============================================================================
//
// マップ用処理 [map.h]
// Author : GP11A132 15 高橋ほの香
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum ICON_LIST
{
	ICON_PLAYER = 0,
	ICON_BOSS,

	ICON_LIST_ALL,
};

#define MAX_ICON		(2)			// 最大アイコン数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	float			x, y;					// 位置
	float			dir;					// 向き
	float			w, h;					// サイズ
	int				texNo;					// テクスチャ
} MAP;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMap(void);
void UninitMap(void);
void UpdateMap(void);
void DrawMap(void);

// XMFLOAT2 ConvertToScreenSpace(XMFLOAT3 worldPos);
XMFLOAT2 ConvertToMapSpace(XMFLOAT3 worldPos);
